HenryQalmari/Adafruit_nRF52_Arduino_SulaJalmari/boards.txt
menu.softdevice=SoftDevice
menu.debug=Debug Level
menu.debug_output=Debug Port

# -----------------------------------
# Qalmari SulaJalmari
# -----------------------------------
sulajalmari.name=Qalmari SulaJalmari

# VID/PID for Bootloader, Arduino & CircuitPython
sulajalmari.vid.0=0x239A
sulajalmari.pid.0=0x8029
sulajalmari.vid.1=0x239A
sulajalmari.pid.1=0x0029
sulajalmari.vid.2=0x239A
sulajalmari.pid.2=0x002A
sulajalmari.vid.3=0x239A
sulajalmari.pid.3=0x802A

# Upload
sulajalmari.bootloader.tool=bootburn
sulajalmari.upload.tool=nrfutil
sulajalmari.upload.protocol=nrfutil
sulajalmari.upload.use_1200bps_touch=true
sulajalmari.upload.wait_for_upload_port=true
sulajalmari.upload.maximum_size=815104
sulajalmari.upload.maximum_data_size=237568

# Build
sulajalmari.build.mcu=cortex-m4
sulajalmari.build.f_cpu=64000000
sulajalmari.build.board=SULAJALMARI
sulajalmari.build.core=nRF5
sulajalmari.build.variant=sulajalmari
sulajalmari.build.usb_manufacturer="Qalmari"
sulajalmari.build.usb_product="SulaJalmari"
sulajalmari.build.extra_flags=-DNRF52840_XXAA {build.flags.usb}
sulajalmari.build.ldscript=nrf52840_s140_v6.ld
sulajalmari.build.openocdscript=scripts/openocd/daplink_nrf52.cfg
sulajalmari.build.vid=0x239A
sulajalmari.build.pid=0x8029
sulajalmari.build.uf2_family=0xADA52840

# Menu: SoftDevice
sulajalmari.menu.softdevice.s140v6=S140 6.1.1
sulajalmari.menu.softdevice.s140v6.build.sd_name=s140
sulajalmari.menu.softdevice.s140v6.build.sd_version=6.1.1
sulajalmari.menu.softdevice.s140v6.build.sd_fwid=0x00B6

# Menu: Debug Level
sulajalmari.menu.debug.l0=Level 0 (Release)
sulajalmari.menu.debug.l0.build.debug_flags=-DCFG_DEBUG=0
sulajalmari.menu.debug.l1=Level 1 (Error Message)
sulajalmari.menu.debug.l1.build.debug_flags=-DCFG_DEBUG=1
sulajalmari.menu.debug.l2=Level 2 (Full Debug)
sulajalmari.menu.debug.l2.build.debug_flags=-DCFG_DEBUG=2
sulajalmari.menu.debug.l3=Level 3 (Segger SystemView)
sulajalmari.menu.debug.l3.build.debug_flags=-DCFG_DEBUG=3
sulajalmari.menu.debug.l3.build.sysview_flags=-DCFG_SYSVIEW=1

# Menu: Debug Port
sulajalmari.menu.debug_output.serial=Serial
sulajalmari.menu.debug_output.serial.build.logger_flags=-DCFG_LOGGER=0
sulajalmari.menu.debug_output.serial1=Serial1
sulajalmari.menu.debug_output.serial1.build.logger_flags=-DCFG_LOGGER=1 -DCFG_TUSB_DEBUG=CFG_DEBUG
sulajalmari.menu.debug_output.rtt=Segger RTT
sulajalmari.menu.debug_output.rtt.build.logger_flags=-DCFG_LOGGER=2 -DCFG_TUSB_DEBUG=CFG_DEBUG -DSEGGER_RTT_MODE_DEFAULT=SEGGER_RTT_MODE_BLOCK_IF_FIFO_FULL
